/* Detector help functions */
#ifndef DETECTOR_HF_H
#define DETECTOR_HF_H
/////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////
#include "utils/cvwrap.h"
#include "math/astrocalc.h"
#include "boxes/frame.h"
#include "boxes/artifact.h"
/////////////////////////////////////////////////////////////////////////////////////
namespace detector_hf
{
void findTargets(Frame &f,                 //input
                 ArtifactVector &av,       //output
                 const int minSquare = 9,   /* нижний порог по площади найденного объекта */
                 const bool MTI = false,    /* Moving-Target Indication (селекция движущихся целей)
                                              только для накопленного кадра */
                 const int maxOblong = 2); /* верхний порог по коэффициенту вытянутости объекта;
                                              используется в режиме MTI для _отсечения_ движущихся целей,
                                              которые имеют вытянутую форму - трек (ибо накопление) */
}
/////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////
#endif // DETECTOR_HF_H
